Revit 2027 API
ElementParameterFilter(FilterRule) Constructor
 Constructs a new instance of an ElementParameterFilter from a single rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementParameterFilter(
	FilterRule filterRule
)
Public Sub New (
	filterRule As FilterRule
)
public:
ElementParameterFilter(
	FilterRule^ filterRule
)
new :
        filterRule : FilterRule -> ElementParameterFilter
Parameters
filterRule FilterRule
 The rule applied to test if the element passes this filter.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementParameterFilter Class
ElementParameterFilter Overload
Autodesk.Revit.DB Namespace